# CLI tools
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"
brew "tectonic"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI apps
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "firefox"
cask "font-monaspace"
cask "ghostty"
cask "google-chrome"
cask "nordvpn"
cask "rectangle"
cask "visual-studio-code"
cask "vlc"
